---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.NLevelPerimeter
source: html/49ba6c5f-84ac-645e-76bf-c0dcc13aa04c.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.NLevelPerimeter Property

The perimeter of the intersection of the MassLevelData's level with the mass geometry.

## Syntax (C#)
```csharp
public double NLevelPerimeter { get; }
```